In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler, LabelEncoder
from sklearn import svm
from sklearn.svm import SVC
from sklearn.model_selection import GridSearchCV
from sklearn.metrics import classification_report
from sklearn.metrics import accuracy_score, confusion_matrix
from sklearn.model_selection import train_test_split, cross_val_score

In [2]:
data = pd.read_csv('/content/SalaryData_Train(1).csv')

In [3]:
data.head()

   age         workclass  education  ...  hoursperweek         native Salary
0   39         State-gov  Bachelors  ...            40  United-States  <=50K
1   50  Self-emp-not-inc  Bachelors  ...            13  United-States  <=50K
2   38           Private    HS-grad  ...            40  United-States  <=50K
3   53           Private       11th  ...            40  United-States  <=50K
4   28           Private  Bachelors  ...            40           Cuba  <=50K

[5 rows x 14 columns]

In [4]:
data.tail(5)

       age     workclass   education  ...  hoursperweek         native Salary
30156   27       Private  Assoc-acdm  ...            38  United-States  <=50K
30157   40       Private     HS-grad  ...            40  United-States   >50K
30158   58       Private     HS-grad  ...            40  United-States  <=50K
30159   22       Private     HS-grad  ...            20  United-States  <=50K
30160   52  Self-emp-inc     HS-grad  ...            40  United-States   >50K

[5 rows x 14 columns]

In [5]:
data.shape

(30161, 14)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30161 entries, 0 to 30160
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            30161 non-null  int64
 1   workclass      30161 non-null  object
 2   education      30161 non-null  object
 3   educationno    30161 non-null  int64
 4   maritalstatus  30161 non-null  object
 5   occupation     30161 non-null  object
 6   relationship   30161 non-null  object
 7   race           30161 non-null  object
 8   sex            30161 non-null  object
 9   capitalgain    30161 non-null  int64
 10  capitalloss    30161 non-null  int64
 11  hoursperweek   30161 non-null  int64
 12  native         30161 non-null  object
 13  Salary         30161 non-null  object
dtypes: int64(5), object(9)
memory usage: 3.2+ MB

In [7]:
data.isna().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [8]:
data[data.duplicated()]

       age workclass     education  ...  hoursperweek         native Salary
326     33   Private     Bachelors  ...            40  United-States   >50K
364     27   Private     Bachelors  ...            50  United-States  <=50K
518     24   Private       HS-grad  ...            40  United-States  <=50K
525     24   Private       HS-grad  ...            40  United-States  <=50K
619     33   Private     Bachelors  ...            40  United-States   >50K
...    ...       ...           ...  ...           ...            ...    ...
30110   47   Private       HS-grad  ...            40  United-States  <=50K
30118   20   Private       HS-grad  ...            40  United-States  <=50K
30132   22   Private  Some-college  ...            40  United-States  <=50K
30157   40   Private       HS-grad  ...            40  United-States   >50K
30159   22   Private       HS-grad  ...            20  United-States  <=50K

[3258 rows x 14 columns]

In [9]:
data = data.drop_duplicates()

In [10]:
data.shape

(26903, 14)

In [11]:
data = data.reset_index(drop=True)

In [12]:
encoder = LabelEncoder()
for i in data.columns:
    print(i)
    if data[i].dtypes == object:
        data[i] = encoder.fit_transform(data[i])
    else:
        pass

age
workclass
education
educationno
maritalstatus
occupation
relationship
race
sex
capitalgain
capitalloss
hoursperweek
native
Salary

In [13]:
X = data.iloc[:,0:13]
Y = data.iloc[:,13]

In [14]:
X

       age  workclass  education  ...  capitalloss  hoursperweek  native
0       39          5          9  ...            0            40      37
1       50          4          9  ...            0            13      37
2       38          2         11  ...            0            40      37
3       53          2          1  ...            0            40      37
4       28          2          9  ...            0            40       4
...    ...        ...        ...  ...          ...           ...     ...
26898   53          2         12  ...            0            40      37
26899   22          2         15  ...            0            40      37
26900   27          2          7  ...            0            38      37
26901   58          2         11  ...            0            40      37
26902   52          3         11  ...            0            40      37

[26903 rows x 13 columns]

In [15]:
x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size=0.3)

In [16]:
x_train.shape, y_train.shape, x_test.shape, y_test.shape

((18832, 13), (18832,), (8071, 13), (8071,))

#Grid Search CV

In [17]:
#clf = SVC()
#param_grid = [{'kernel' : ['rbf'], 'gamma' : [50,5, 10, 0.5], 'C': [15,14,11,10, 0.001]}]
#gsv = GridSearchCV(clf, param_grid, cv=10)
#gsv.fit(x_train, y_train)

In [ ]:
model_linear = SVC(kernel = 'linear')
model_linear.fit(x_train, y_train)
pred_test_linear = model_linear.predict(x_test)

np.mean(pred_test_linear==y_test)

In [ ]:
model_poly = SVC(kernel = 'poly')
model_poly.fit(x_train, y_train)
pred_test_poly = model_poly.predict(x_test)

np.mean(pred_test_poly == y_test)

In [ ]:
model_rbf = SVC(kernel = 'rbf')
model_rbf.fit(x_train, y_train)
pred_test_rbf = model_rbf.predict(x_test)

np.mean(pred_test_rbf == y_test)